package com.history;

import java.io.BufferedReader;
import java.io.InputStreamReader;
import java.util.Random;

public class alg {
    static String[] nazv= {"Итальянский и Швейцарский походы А.В. Суворова","правление Александра I","указ о вольных хлебопашцах","открытие Казанского университета",
    "русско-иранская война","русско-иранская война","участие России в войнах с Наполеоном","участие России в войнах с Наполеоном","русско-турецкая война","Тильзитский мир",
    "русско-шведская война, присоединение Финляндии","Отечественная война","Бородинское сражение(год)","заграничные походы русской армии","Лейпцийское сражение","Венский конгресс","Кавказская война",
    "восстание декабристов","правление Николая I","русско-турецкая война(2 война)","восстание в Польше, русско-польская война","утверждение Свода законов Российской империи",
    "реформа управления государственными крестьянами П.Д. Киселева","финансовая реформа Е.Ф.Канкарина","споры между западниками и славянофилами","открытие движения по железной дороге от Москвы до Петербурга",
    "Крымская война","оборона Севастополя","правление Александра II","рескрипт В.И.Назимову, начало создания губернских дворянских комитетов для разработки Крестьянской реформы","создание редакционных комиссий","отмена крепостного права(год)",
    "земская реформа и судебная реформы","присоединение Средней Азии(годы)","реформа городского самоуправления","военная реформа","русско-турецкая война(3 война), освобождение Болгарии","Берлинский конгресс","праление Александра III","Морозовская стачка","начало сторительства Транссибирской магистрали",
    "оформление русско-французского союза","начало промышленного подъема","правление Николая II","денежная реформа С.Ю.Витте"};
    static String[] dates ={"1799","1801-1825","1803","1804","1803-1813","1826-1828","1805",
                            "1806-1807","1806-1812","1807","1808-1809","1812","1812","1813-1814",
                            "1813","1814-1815","1817-1864","1825","1825-1855","1828-1829","1830-1831",
                            "1833","1837-1841","1839-1843","40-50","1851","1853-1856","1854-1855","1855-1881","1857",
                            "1858","1861","1864","60-70","1870","1874","1877-1878","1878","1881-1894","1885","1891",
                            "1891-1893","1893","1894-1917","1897"};
    public static void main(String args[]) {
        int rand;
        String result = "";
        String resultat = "";
        int i = 0;
        Random random = new Random();
        System.out.println("Тест состоит из 20 вопросов."
        + "\n3 и менее ошибки - зачет," + "\n4 и более - незачет." + "Если дата выглядит как 60-70 гг XIX века, просто вводите 60-70."
                + "\n Удачи!" + "\n");
        BufferedReader br = new BufferedReader(new InputStreamReader(System.in));
        for(int k = 0;k<20;k++) {
            rand = random.nextInt(dates.length-1);
            System.out.println("В каком году был(о) " + nazv[rand] + " ?");
            try{
                resultat = br.readLine().trim();
                result = resultat;
            }catch(Exception e) {
                System.out.println("Что-то пошло не так...");
                continue;
            }
            if((result.compareTo(dates[rand]) == 0) || (result.compareTo(dates[rand - 1]) == 0) || (result.compareTo(dates[rand + 1]) == 0)) {
                System.out.println("Верно");
                i++;
            }else System.out.println("Неверно, правильный ответ - " + dates[rand]);
        }
        if(i >=17) { System.out.println("Зачет, поздравляю!");
        System.out.println("───────────▒██████████████▓▒────────────" +
                "\n────────▓█████████████████████▓─────────" +
                "\n─────░████████▓▓▓▒▒▒▒▓▓█▓███████▓───────" +
                "\n────▓██████▓█▒▒▒▒▒▒░▓▒▓▓▓▒▓▒██████──────" +
                "\n───█████▓█▓▓▒▓▓▒░▒░▒░▒▒▓▒▒░▒▒▓▒████▒────" +
                "\n──███▓▓▒▓▓█▓▓▒▒░░░░─────░─────░▒▓███▒───" +
                "\n─███▓▒░▒─░░░────────────────────▒█▓██───" +
                "\n░███▒░▒▒░────────────────────░░─░▓▓███──" +
                "\n▓███▒▒▒▒░░───────────────░░░─░░░░▓▓▓██──" +
                "\n█████▒▒▒░░░░░─░─────────░─░░░▒▒░░▒▓▓██▓─" +
                "\n████▓▓▓▓▒▒░░───────────────────░░░▒▓██▒─" +
                "\n████▓▒▓▒▒░▒────────────────▒▓▓▒─░▒░▓██▓─" +
                "\n▓███▓▒─░░▒▒░─░░────░░▒▓▓████████▓▒░▒██▒─" +
                "\n░██▓█▓▓█████████▓░──▓█████▓▒▒▒▓██▓▒▒██──" +
                "\n─███████▓████████▒───████████████▓░░█▒─▓" +
                "\n─▒█▓█████████▓███▒──░▒░▒▓▒██▓██▒──░░█▒██" +
                "\n███▓▓▒▓███▓▓░░─░██──░░─────░░░─────░▒█──" +
                "\n███▓▒───▒▒▒░░─░░▓▓──░───────────░─░▒▓▒░─" +
                "\n░██▓▓▒───░─░───▓▓▓───░░░───────░─░░▒▓░─▒" +
                "\n▒▓█▒█▓▒▒▒──────▓▒░──────░─────░───░▒▓▒─░" +
                "\n─██▓▓█▓▓▒░────░███░▒▒███░──────░──░▓▓▓─░" +
                "\n─░██▓███▓▒────▓████████▓──░░────░─▒▓▓▒▒░" +
                "\n──▓██▓▓██▓▒░───▒███▓▒──▒░░─░░░─░─░▒▓▒░──" +
                "\n──░▓███▓▓▒▒░▒▒▒▓▓░────░░▓▓█▒▓░▒░░░▒▓░───" +
                "\n─────▓███▓▒█████████▓█▓██████▒░░░─░▓────" +
                "\n──────▓██▓▓████▓▒▒▒░▒░─────▒█─────▓▓────" +
                "\n───────███▒▒░────▒▓███▒─────▒▓───▓█▒░───" +
                "\n───────░███▓▓▒▒───░▓▓░───▒▓▓██▓▒▓██─██──" +
                "\n────────▒███████░───────░▓▓███████░─███─" +
                "\n────────▓▒███████▒▒░░─░▒▓▓███████░──▒███" +
                "\n───────██░█████████▓████████████▒──░░███" +
                "\n──────███▒▓████████████████████▒░──░▒███" +
                "\n───▒▓█████▒███████████████████▒░───░▒███" +
                "\n▓██████████▓███████████████▓▒░░───░─▓███" +
                "\n████████████▓████████████▓▒░────────████" +
                "\n███████████▓▓▓▓██████▓▓▓▒░░────────█████" +
                "\n███████████▓▒▒▒▒▒▓▒▒▒▒▒▒░░░░─░─░──▒█████" +
                "\n████████████░░▒▒▒▒▒░▒▒▒▒░░░░░─░──▒██████" +
                "\n████████████▓──░░▒░░░░░▒░░──────▓███████" +
                "\n██████████████▒───────░───────▓█████████" +
                "\n████████████████▓▒───────────███████████" +
                "\n████████████████████▒──────▓████████████" +
                "\n██████████████████████▒──▓██████████████" +
                "\n████████████████████████████████████████" +
                "\n████████████████████████████████████████" +
                "\n████────███────███────███───███────█████" +
                "\n████─██████─██─███─██─████─████─██─█████" +
                "\n████────███────███─███████─████────█████" +
                "\n████─██─███─██─███─██─████─████─██─█████" +
                "\n████────███─██─███────████─████─██─█████" +
                "\n████████████████████████████████████████"


        ); }
        else System.out.println("Увы, незачет");
        System.out.println("Правильных ответов " + i + " из 20");
    }
}
